Repository: NMarjou/localization-app
Catalog: TMs/en-US_th-TH.tmx
Source language: en_us
Languages: th_th

source: At least one field is required for the custom mode.
th_th: ต้องมีอย่างน้อยหนึ่งฟิลด์สำหรับโหมดกำหนดเอง

source: Search for a feature
th_th: ค้นหาฟีเจอร์

source: Select configuration type
th_th: เลือกประเภทการกำหนดค่า

source: Snapshots
th_th: สแนปชอต

source: Create pay analysis dataset
th_th: สร้างชุดข้อมูลการวิเคราะห์ค่าจ้าง

source: To complete the creation of the data set for the pay analysis, please select the tenant from the PayAnalytics.
th_th: เพื่อทำการสร้างชุดข้อมูลสำหรับการวิเคราะห์ค่าจ้างให้เสร็จสมบูรณ์ โปรดเลือกผู้เช่าจาก PayAnalytics

source: The snapshot you are trying to upload contains non configured currency exchange rates. Please update your currency settings.
th_th: สแนปช็อตที่คุณพยายามอัปโหลดมีอัตราแลกเปลี่ยนสกุลเงินที่ยังไม่ได้กำหนดค่า กรุณาอัปเดตการตั้งค่าสกุลเงินของคุณ

source: The data contains null values in numerical fields. Please the log file for more information.
th_th: ข้อมูลมีค่าเป็นค่าว่างในฟิลด์ตัวเลข โปรดดูไฟล์บันทึกสำหรับข้อมูลเพิ่มเติม

source: The data set was successfully created.
th_th: สร้างชุดข้อมูลสำเร็จแล้ว

source: An error occurred while processing data in PayAnalytics. Please contact Customer Support.
th_th: เกิดข้อผิดพลาดขณะประมวลผลข้อมูลใน PayAnalytics โปรดติดต่อฝ่ายสนับสนุนลูกค้า

source: Dataset name
th_th: ชื่อชุดข้อมูล

source: The name of the data set is required.
th_th: จำเป็นต้องระบุชื่อชุดข้อมูล

source: The current authorization settings will result in the creation of an empty dataset. Please verify your worker access.
th_th: การตั้งค่าการให้อำนาจปัจจุบันจะทำให้เกิดการสร้างชุดข้อมูลว่าง โปรดตรวจสอบสิทธิ์การเข้าถึงพนักงานของคุณ

source: Empty dataset
th_th: ชุดข้อมูลว่าง

source: Select PayAnalytics tenant
th_th: เลือกผู้เช่า PayAnalytics

source: The PayAnalytics tenant is required.
th_th: ต้องระบุเทนเนนต์ของ PayAnalytics

source: This snapshot does not contain the worker category required as the main group. You can send the snapshot without a main group, or cancel and update the snapshot or mapping.
th_th: สแน็ปช็อตนี้ไม่มีหมวดหมู่พนักงานที่จำเป็นต้องใช้เป็นกลุ่มหลัก คุณสามารถส่งสแน็ปช็อตโดยไม่มีกลุ่มหลัก หรือยกเลิกและอัปเดตสแน็ปช็อตหรือการแมปได้

source: Worker category absent from snapshot
th_th: ไม่มีหมวดหมู่พนักงานในสแนปชอต

source: The generated snapshot was unable to populate the worker category field for all workers. Please check your data.
th_th: สแน็ปช็อตที่สร้างขึ้นไม่สามารถกรอกข้อมูลในช่องหมวดหมู่พนักงานให้ครบสำหรับพนักงานทุกคนได้ โปรดตรวจสอบข้อมูลของคุณ

source: Worker category partially missing
th_th: หมวดหมู่พนักงานหายไปบางส่วน

source: The name of the model must be unique.
th_th: ชื่อตัวแบบต้องไม่ซ้ำกับผู้อื่น

source: Enter the basic information of the model
th_th: ป้อนข้อมูลพื้นฐานของโมเดล

source: Performance Management entities
th_th: เอนทิตีการบริหารผลงาน

source: Core HR entities
th_th: เอนทิตี HR หลัก

source: Others entities
th_th: หน่วยงานอื่น ๆ

source: Compensation Management entities
th_th: เอนทิตีการจัดการค่าตอบแทน

source: Model design
th_th: การออกแบบโมเดล

source: Define the entities and other sources to use as the model base
th_th: กำหนดเอนทิตีและแหล่งอื่น ๆ ที่จะใช้เป็นฐานโมเดล

source: Define the entities and fields to include in this model.
th_th: กำหนดเอนทิตีและฟิลด์ที่จะรวมไว้ในโมเดลนี้

source: No selected entities
th_th: ไม่มีเอนทิตีที่เลือก

source: Data Entities & Sources
th_th: เอนทิตีและแหล่งที่มาของข้อมูล

source: Entities: {{count}}
th_th: เอนทิตี: {{count}}

source: Fields: {{count}}
th_th: ฟิลด์: {{count}}

source: Selected fields
th_th: ฟิลด์ที่เลือก

source: Tree entities
th_th: เอนทิตีแผนผัง

source: View the fields already included in this model.
th_th: ดูฟิลด์ที่รวมอยู่ในโมเดลนี้แล้ว

source: Current fields
th_th: ฟิลด์ปัจจุบัน

source: This model already includes all available fields from the database. There are no additional fields to add.
th_th: โมเดลนี้มีฟิลด์ทั้งหมดที่มีอยู่ในฐานข้อมูลแล้ว ไม่มีฟิลด์เพิ่มเติมให้เพิ่ม

source: All fields have already been added
th_th: เพิ่มทุกฟิลด์แล้ว

source: Select additional fields from the database to extend this model.
th_th: เลือกฟิลด์เพิ่มเติมจากฐานข้อมูลเพื่อขยายโมเดลนี้

source: Add more fields
th_th: เพิ่มฟิลด์เพิ่มเติม

source: Extend model - {{name}}
th_th: ขยายแบบจำลอง - {{name}}

source: Grid preview
th_th: ตัวอย่างตาราง

source: Review & publish model
th_th: ตรวจสอบและเผยแพร่โมเดล

source: Data Modeling
th_th: การสร้างแบบจำลองข้อมูล

source: No selected fields. Please select at least one field to save or proceed.
th_th: ไม่มีฟิลด์ที่เลือก โปรดเลือกอย่างน้อยหนึ่งฟิลด์เพื่อบันทึกหรือดำเนินการต่อ

source: The model was successfully published.
th_th: โมเดลได้รับการเผยแพร่สำเร็จแล้ว

source: The model was successfully saved.
th_th: บันทึกโมเดลสำเร็จแล้ว

source: Policies
th_th: นโยบาย

source: Data Privacy
th_th: ความเป็นส่วนตัวของข้อมูล

source: Compliance & Storage
th_th: การปฏิบัติตามข้อกำหนดและการจัดเก็บข้อมูล

source: Role & Permission Management
th_th: การจัดการบทบาทและสิทธิ์

source: Exchange rates
th_th: อัตราแลกเปลี่ยน

source: Exchange rate
th_th: อัตราแลกเปลี่ยน

source: From
th_th: จาก

source: Identifier
th_th: ตัวระบุ

source: To
th_th: ถึง

source: Exchange rate template
th_th: เทมเพลตอัตราแลกเปลี่ยน

source: Exchange Rates
th_th: อัตราแลกเปลี่ยน

source: The exchange rate type was successfully created.
th_th: สร้างประเภทอัตราแลกเปลี่ยนสำเร็จแล้ว

source: Create type
th_th: สร้างประเภท

source: Are you sure you want to delete this exchange rate type? It will no longer be usable in any future processes.
th_th: คุณแน่ใจหรือว่าต้องการลบประเภทอัตราแลกเปลี่ยนนี้? จะไม่สามารถใช้งานได้ในกระบวนการในอนาคตอีกต่อไป

source: The exchange rate type successfully was deleted.
th_th: ลบประเภทอัตราแลกเปลี่ยนเรียบร้อยแล้ว

source: Create exchange rate type
th_th: สร้างประเภทอัตราแลกเปลี่ยน

source: Edit exchange rate type
th_th: แก้ไขประเภทอัตราแลกเปลี่ยน

source: The exchange rate type was successfully edited.
th_th: แก้ไขประเภทอัตราแลกเปลี่ยนเรียบร้อยแล้ว

source: The exchange rate type code must be unique.
th_th: รหัสประเภทอัตราแลกเปลี่ยนต้องไม่ซ้ำกัน

source: Types
th_th: ประเภท

source: Created
th_th: สร้างแล้ว

source: Search for a type
th_th: ค้นหาประเภท

source: Exchange Rates Types
th_th: ประเภทอัตราแลกเปลี่ยน

source: An error occurred when validating the file. Please check the column names, the mandatory data and the file format, and then try again.
th_th: เกิดข้อผิดพลาดขณะตรวจสอบไฟล์ กรุณาตรวจสอบชื่อคอลัมน์ ข้อมูลที่จำเป็น และรูปแบบไฟล์ จากนั้นลองใหม่อีกครั้ง

source: Click upload to add files.
th_th: คลิกอัปโหลดเพื่อเพิ่มไฟล์

source: 10MB max per file
th_th: สูงสุด 10MB ต่อไฟล์

source: Supported formats: CSV
th_th: รูปแบบที่รองรับ: CSV

source: Some records could not be uploaded. Please check the provided CSV log file for more details.
th_th: ไม่สามารถอัปโหลดข้อมูลบางรายการได้ กรุณาตรวจสอบไฟล์บันทึก CSV ที่ให้มาเพื่อดูรายละเอียดเพิ่มเติม

source: Extensions & Plugins
th_th: ส่วนขยายและปลั๊กอิน

source: Feature groups
th_th: กลุ่มฟีเจอร์

source: Select a group to see the corresponding features or options.
th_th: เลือกกลุ่มเพื่อดูฟีเจอร์หรือทางเลือกที่เกี่ยวข้อง

source: Alphanumeric
th_th: อักขระตัวเลข

source: Date & Time
th_th: วันที่และเวลา

source: Linked to the selected language
th_th: เชื่อมโยงกับภาษาที่เลือก

source: You are about to delete the data scope <name>{{name}}</name>. Are you sure you want to proceed?
th_th: คุณกำลังจะลบขอบเขตข้อมูล <name>{{name}}</name> ท่านแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?

source: Delete data scope
th_th: ลบขอบเขตข้อมูล

source: Data scope name
th_th: ชื่อขอบเขตข้อมูล

source: The name cannot be empty. Please provide a name for the data scope.
th_th: ชื่อไม่สามารถเว้นว่างได้ กรุณาระบุชื่อสำหรับขอบเขตข้อมูล

source: Create data scope
th_th: สร้างขอบเขตข้อมูล

source: The data scope was successfully created.
th_th: สร้างขอบเขตข้อมูลสำเร็จแล้ว

source: The data scope was successfully deleted.
th_th: ลบขอบเขตข้อมูลเรียบร้อยแล้ว

source: Edit data scope
th_th: แก้ไขขอบเขตข้อมูล

source: No data scopes yet
th_th: ยังไม่มีขอบเขตข้อมูล

source: Data Scope Manager
th_th: ผู้จัดการขอบเขตข้อมูล

source: Data scopes
th_th: ขอบเขตข้อมูล

source: Pay automation
th_th: ระบบอัตโนมัติด้านค่าจ้าง

source: The target variable cannot be empty. Please provide a value.
th_th: ตัวแปรเป้าหมายต้องไม่เว้นว่าง กรุณาระบุค่า

source: Select the target variable you want to model
th_th: เลือกตัวแปรเป้าหมายที่คุณต้องการสร้างโมเดล

source: The data model cannot be empty. Please provide a data model.
th_th: โมเดลข้อมูลไม่สามารถเว้นว่างได้ กรุณาให้ข้อมูลโมเดล

source: Create and include snapshot
th_th: สร้างและแนบสแนปช็อต

source: Models
th_th: โมเดล

source: Purpose
th_th: วัตถุประสงค์

source: Transformations
th_th: การแปลงข้อมูล

source: Log transformation
th_th: การแปลงลอการิทึม

source: Select which additional information you want to include in this snapshot.
th_th: เลือกข้อมูลเพิ่มเติมที่คุณต้องการรวมไว้ในสแนปชอตนี้

source: Create & manage machine learning models
th_th: สร้างและจัดการโมเดลแมชชีนเลิร์นนิง

source: Are you sure you want to delete the model "{{name}}"? This action cannot be undone.
th_th: คุณแน่ใจหรือว่าต้องการลบโมเดล "{{name}}"? การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Delete model
th_th: ลบโมเดล

source: Model Manager
th_th: ผู้จัดการโมเดล

source: The model name cannot be empty.
th_th: ชื่อโมเดลต้องไม่เว้นว่าง

source: Model type
th_th: ประเภทโมเดล

source: The model type cannot be empty.
th_th: ประเภทโมเดลต้องไม่เว้นว่าง

source: The snapshot cannot be empty.
th_th: สแนปช็อตต้องไม่เว้นว่าง

source: Model type & snapshot
th_th: ประเภทโมเดลและสแน็ปช็อต

source: Auto-update
th_th: อัปเดตอัตโนมัติ

source: Disable in all features
th_th: ปิดใช้งานในทุกฟีเจอร์

source: Enable in all features
th_th: เปิดใช้งานในทุกฟีเจอร์

source: Multicollinearity check
th_th: การตรวจสอบความสัมพันธ์เชิงพหุคูณระหว่างตัวแปร

source: Data auto-update
th_th: อัปเดตข้อมูลอัตโนมัติ

source: Define which attributes will be available in the model. For proper model training, select at least 5 features.
th_th: กำหนดแอตทริบิวต์ที่จะพร้อมใช้งานในโมเดล สำหรับการฝึกสอนโมเดลอย่างเหมาะสม ให้เลือกคุณลักษณะอย่างน้อย 5 รายการ

source: Please select at least one feature.
th_th: โปรดเลือกคุณสมบัติอย่างน้อยหนึ่งรายการ

source: {{featuresCount}} features selected
th_th: {{featuresCount}} ฟีเจอร์ที่เลือก

source: By default, the model will train using ridge regression and will generate regularised estimators for every feature selected in the model. If you validate, we will check the Ordinary Least Squares (OLS) regression and remove perfect multicollinearity among selected features.
th_th: โดยค่าเริ่มต้น โมเดลจะฝึกด้วยริจ์เรกเกรสชัน และสร้างตัวประมาณค่าแบบมีการทำให้เป็นปกติสำหรับทุกฟีเจอร์ที่เลือกในโมเดล หากคุณทำการตรวจสอบความถูกต้อง เราจะตรวจสอบการถดถอยแบบกำลังสองน้อยที่สุดแบบธรรมดา (OLS) และลบความพหุสหสัมพันธ์ที่สมบูรณ์แบบออกจากบรรดาฟีเจอร์ที่เลือก

source: Select model features
th_th: เลือกคุณลักษณะของโมเดล

source: If you continue with this population change, your current feature selections will be cleared. Are you sure you want to proceed?
th_th: หากคุณดำเนินการเปลี่ยนแปลงกลุ่มพนักงานนี้ต่อไป การเลือกฟีเจอร์ปัจจุบันของคุณจะถูกล้าง คุณแน่ใจหรือไม่ว่าต้องการดำเนินการต่อ?

source: Confirm population change
th_th: ยืนยันการเปลี่ยนแปลงประชากร

source: Select the criteria that will determine who is included in this population.
th_th: เลือกเกณฑ์ที่จะกำหนดว่าใครจะถูกรวมอยู่ในกลุ่มนี้

source: Define the name, description and details of the model.
th_th: กำหนดชื่อ คำอธิบาย และรายละเอียดของโมเดล

source: Select options and features applicable for the model.
th_th: เลือกตัวเลือกและฟีเจอร์ที่ใช้กับโมเดล

source: Model attributes
th_th: คุณลักษณะของโมเดล

source: Define the population criteria for the model.
th_th: กำหนดเกณฑ์ของกลุ่มพนักงานสำหรับโมเดล

source: Review and publish new model.
th_th: ตรวจทานและเผยแพร่โมเดลใหม่

source: Population & features
th_th: ประชากรและฟีเจอร์

source: Features selected
th_th: คุณสมบัติที่เลือก

source: Selected roles
th_th: บทบาทที่เลือก

source: Total population
th_th: ประชากรรวม

source: Quick train
th_th: ฝึกอบรมอย่างรวดเร็ว

source: Data scope
th_th: ขอบเขตข้อมูล

source: Select data scope
th_th: เลือกขอบเขตข้อมูล

source: Search for a model
th_th: ค้นหาโมเดล

source: Total models
th_th: โมเดลทั้งหมด

source: This note will be visible to everyone reviewing this worker in the pay analysis results.
th_th: บันทึกนี้จะแสดงให้ทุกคนที่กำลังทบทวนพนักงานคนนี้เห็นในการวิเคราะห์ผลค่าตอบแทน

source: Analysis
th_th: การวิเคราะห์

source: Nb. of subgroups
th_th: จำนวนกลุ่มย่อย

source: Subgroup field
th_th: ฟิลด์กลุ่มย่อย

source: Pay analysis
th_th: การวิเคราะห์ค่าตอบแทน

source: The maximum length of the note is {{max}} characters.
th_th: ความยาวสูงสุดของบันทึกคือ {{max}} อักขระ

source: The note content is required. Please enter your note before saving.
th_th: จำเป็นต้องกรอกเนื้อหาบันทึกย่อ โปรดป้อนบันทึกย่อของคุณก่อนบันทึก

source: Configuration details
th_th: รายละเอียดการกำหนดค่า

source: View analysis
th_th: ดูการวิเคราะห์

source: The visibility was successfully updated.
th_th: อัปเดตการมองเห็นเรียบร้อยแล้ว

source: Change visibility
th_th: เปลี่ยนการมองเห็น

source: The analysis result was successfully deleted.
th_th: ลบผลการวิเคราะห์สำเร็จแล้ว

source: Are you sure you want to delete the analysis result? This action cannot be undone.
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบผลการวิเคราะห์? การดำเนินการนี้ไม่สามารถย้อนกลับได้

source: Backwards elimination
th_th: การตัดออกแบบย้อนกลับ

source: Categorical variables
th_th: ตัวแปรเชิงจัดหมวดหมู่

source: Close pay gaps on a per-group basis
th_th: ปิดช่องว่างค่าจ้างตามแต่ละกลุ่ม

source: Demographic variables
th_th: ตัวแปรด้านประชากรศาสตร์

source: Fairness weight (against cost-effectiveness)
th_th: น้ำหนักด้านความเป็นธรรม (เทียบกับความคุ้มค่าเชิงต้นทุน)

source: Group fairness weight (against individual fairness)
th_th: น้ำหนักความยุติธรรมแบบกลุ่ม (เทียบกับความยุติธรรมรายบุคคล)

source: Max rise
th_th: การขึ้นสูงสุด

source: Number of workers excluded from raise suggestions
th_th: จำนวนพนักงานที่ถูกตัดออกจากข้อเสนอการปรับขึ้นเงินเดือน

source: Pay gap target (gender)
th_th: เป้าหมายช่องว่างค่าจ้าง (ตามเพศ)

source: Analysis run on
th_th: วิเคราะห์เมื่อ

source: Run by
th_th: ดำเนินการโดย

source: Subgroups
th_th: กลุ่มย่อย

source: Sync analysis
th_th: ซิงก์การวิเคราะห์

source: No analyses available yet.
th_th: ยังไม่มีการวิเคราะห์ให้ใช้งาน

source: Pay analysis results
th_th: ผลการวิเคราะห์ค่าตอบแทน

source: Publish analysis
th_th: เผยแพร่การวิเคราะห์

source: Apply changes
th_th: นำการเปลี่ยนแปลงไปใช้

source: The current grid configuration will be sent to the selected entities. Please double-check whether all visible columns are needed for the further raise recommendation process.
th_th: การตั้งค่าตารางปัจจุบันจะถูกส่งไปยังหน่วยงานที่เลือก โปรดตรวจสอบให้แน่ใจอีกครั้งว่าคอลัมน์ที่มองเห็นทั้งหมดจำเป็นต่อกระบวนการเสนอขึ้นเงินเดือนในขั้นต่อไปหรือไม่

source: Define access and permissions for this analysis.
th_th: กำหนดการเข้าถึงและสิทธิ์สำหรับการวิเคราะห์นี้

source: Can comment
th_th: สามารถแสดงความคิดเห็นได้

source: Can edit
th_th: สามารถแก้ไขได้

source: Can view admin comment
th_th: สามารถดูความคิดเห็นของผู้ดูแลระบบได้

source: Can view HRBP comment
th_th: สามารถดูคำคิดเห็นของ HRBP ได้

source: Compensation recommendation
th_th: คำแนะนำด้านค่าตอบแทน

source: Final offer
th_th: ข้อเสนอสุดท้าย

source: Give access
th_th: ให้สิทธิ์เข้าถึง

source: Pay analysis settings
th_th: การตั้งค่าการวิเคราะห์ค่าตอบแทน

source: Prepopulated final raise proposals with recommendation.
th_th: ข้อเสนอการปรับขึ้นเงินเดือนสุดท้ายที่กรอกไว้ล่วงหน้าพร้อมคำแนะนำ

source: The analysis was successfully published to the Planner.
th_th: การวิเคราะห์ถูกเผยแพร่ไปยัง Planner เรียบร้อยแล้ว

source: Publish analysis to planner
th_th: เผยแพร่การวิเคราะห์ไปยังตัววางแผน

source: Set {{permission}} for {{section}}
th_th: กำหนด {{permission}} สำหรับ {{section}}

source: Demographic used
th_th: ประชากรศาสตร์ที่ใช้

source: Snapshot
th_th: สแน็ปช็อต

source: Columns
th_th: คอลัมน์

source: Workbench visibility
th_th: การมองเห็นเวิร์กเบนช์

source: Save & close
th_th: บันทึกและปิด

source: Save configuration
th_th: บันทึกการกำหนดค่า

source: Planner visibility
th_th: การมองเห็นของผู้วางแผน

source: The column display settings were successfully saved.
th_th: บันทึกการตั้งค่าการแสดงคอลัมน์เรียบร้อยแล้ว

source: Show insights
th_th: แสดงข้อมูลเชิงลึก

source: Comp. manager
th_th: ผู้จัดการค่าตอบแทน

source: Compensation after final raise
th_th: ค่าตอบแทนหลังจากการขึ้นครั้งสุดท้าย

source: Compensation after recommended raise
th_th: ค่าตอบแทนหลังจากการปรับขึ้นเงินเดือนตามคำแนะนำ

source: Distance from predicted compensation
th_th: ระยะห่างจากค่าตอบแทนที่คาดการณ์ไว้

source: Distance from predicted compensation (after final raise)
th_th: ระยะห่างจากค่าตอบแทนที่คาดการณ์ (หลังการปรับขึ้นสุดท้าย)

source: Outlier % (after final raise)
th_th: % ค่าผิดปกติ (หลังการปรับขึ้นสุดท้าย)

source: Final raise amount
th_th: จำนวนเงินที่ขึ้นครั้งสุดท้าย

source: Final raise %
th_th: เปอร์เซ็นต์การขึ้นครั้งสุดท้าย

source: Line manager
th_th: หัวหน้างาน

source: Outlier % (after raise)
th_th: เปอร์เซ็นต์นอกกรอบ (หลังปรับขึ้นเงินเดือน)

source: Recommended raise amount
th_th: จำนวนเงินขึ้นเงินเดือนที่แนะนำ

source: Recommended raise %
th_th: เปอร์เซ็นต์การขึ้นเงินเดือนที่แนะนำ

source: Based on data from the following snapshot: {{snapshotName}}
th_th: จากข้อมูลในสแน็ปช็อตต่อไปนี้: {{snapshotName}}

source: Current
th_th: ปัจจุบัน

source: Female lower than male
th_th: ผู้หญิงต่ำกว่าผู้ชาย

source: Final
th_th: สิ้นสุด

source: Male lower than female
th_th: ผู้ชายต่ำกว่าผู้หญิง

source: Recommended
th_th: แนะนำ

source: Adjusted pay gaps by demographics
th_th: ช่องว่างค่าตอบแทนที่ปรับแล้วตามข้อมูลประชากร

source: Compare unadjusted and adjusted pay gaps by demographic group (relative to the reference group).
th_th: เปรียบเทียบช่องว่างค่าจ้างก่อนปรับและหลังปรับตามกลุ่มประชากร (เทียบกับกลุ่มอ้างอิง)

source: Number of raises
th_th: จำนวนการขึ้นเงินเดือน

source: Total cost of raises
th_th: ต้นทุนรวมของการขึ้นเงินเดือน

source: The compensation after raise cannot be lower than the current salary.
th_th: ค่าตอบแทนหลังการขึ้นเงินเดือนต้องไม่ต่ำกว่าระดับเงินเดือนปัจจุบัน

source: The note was successfully added.
th_th: เพิ่มบันทึกเรียบร้อยแล้ว

source: The note was successfully updated.
th_th: อัปเดตบันทึกสำเร็จแล้ว

source: Note options
th_th: ตัวเลือกหมายเหตุ

source: The configuration for time in role or leave of absence has been modified. Saving these changes will impact future snapshots and related data.
th_th: การกำหนดค่าสำหรับระยะเวลาในบทบาทหรือการลางานได้รับการแก้ไขแล้ว การบันทึกการเปลี่ยนแปลงเหล่านี้จะส่งผลต่อสแนปช็อตในอนาคตและข้อมูลที่เกี่ยวข้อง

source: Select absence type
th_th: เลือกประเภทการขาดงาน

source: A Leave of absence (LOA) allows workers to take time off work for specific reasons beyond standard paid time off. It may be paid or unpaid, depending on company policies and the purpose of the leave. Common reasons include medical issues, family emergencies, maternity/paternity, education, or personal matters.
th_th: การลาพักงาน (LOA) ช่วยให้พนักงานสามารถลางานเป็นระยะเวลาหนึ่งด้วยเหตุผลเฉพาะที่อยู่นอกเหนือจากวันลาพักผ่อนแบบมีค่าจ้างปกติ ซึ่งอาจเป็นแบบมีค่าจ้างหรือไม่มีค่าจ้าง ขึ้นอยู่กับนโยบายของบริษัทและวัตถุประสงค์ของการลา เหตุผลที่พบบ่อยได้แก่ ปัญหาด้านสุขภาพ ภาวะฉุกเฉินของครอบครัว การลาคลอด/ลาพ่อใหม่ การศึกษา หรือเหตุผลส่วนตัว

source: Select which absence types will apply to this policy and the related grace periods for these absences.
th_th: เลือกประเภทการขาดงานที่จะใช้กับนโยบายนี้และระยะเวลาผ่อนผันที่เกี่ยวข้องสำหรับการขาดงานเหล่านี้

source: Enable leave of absence
th_th: เปิดใช้งานการลางาน

source: Leave of absence
th_th: การลางาน

source: Leave of absence definition
th_th: คำนิยามของการลางาน

source: Select which absence types will apply to this policy
th_th: เลือกประเภทการขาดงานที่จะใช้กับนโยบายนี้

source: Add absence type
th_th: เพิ่มประเภทการขาดงาน

source: Edit absence type
th_th: แก้ไขประเภทการขาดงาน

source: The leave of absence is missing the selected types.
th_th: การลางานไม่มีประเภทที่เลือกไว้

source: Grace period (days)
th_th: ระยะเวลาผ่อนผัน (วัน)

source: The configuration of the modeler was saved successfully.
th_th: บันทึกการกำหนดค่าของตัวสร้างโมเดลเรียบร้อยแล้ว

source: Add significant field
th_th: เพิ่มฟิลด์ที่สำคัญ

source: Time in role refers to the duration a worker has spent in their current position or role within an organization. This metric is often used to assess experience, eligibility for promotions, transfers, or additional responsibilities.
th_th: “ระยะเวลาในตำแหน่ง” หมายถึงระยะเวลาที่พนักงานปฏิบัติงานในตำแหน่งปัจจุบันของตนภายในองค์กร ตัวชี้วัดนี้มักใช้เพื่อประเมินประสบการณ์ คุณสมบัติสำหรับการเลื่อนตำแหน่ง การย้ายตำแหน่ง หรือการรับผิดชอบเพิ่มเติม

source: Significant field definition
th_th: คำนิยามฟิลด์ที่สำคัญ

source: Select the field that will trigger a time in role change for workers.
th_th: เลือกฟิลด์ที่จะเป็นตัวกระตุ้นการเปลี่ยนแปลงระยะเวลาในบทบาทสำหรับพนักงาน

source: Edit significant field
th_th: แก้ไขฟิลด์ที่สำคัญ

source: The time in role is missing the selected fields.
th_th: เวลาที่อยู่ในบทบาทไม่มีข้อมูลในฟิลด์ที่เลือก

source: Select the fields that will trigger a time in role change for workers.
th_th: เลือกฟิลด์ที่จะเป็นตัวกระตุ้นการเปลี่ยนแปลงระยะเวลาในบทบาทสำหรับพนักงาน

source: Enable time in role
th_th: เปิดใช้งานเวลาที่อยู่ในบทบาท

source: Situation & Absence Configuration
th_th: การตั้งค่าเหตุการณ์และการขาดงาน

source: Company Structure
th_th: โครงสร้างบริษัท

source: You don't have permission to delete this payout curve. Only users with the Global compensation admin role can perform this action.
th_th: คุณไม่มีสิทธิ์ลบเส้นโค้งการจ่ายเงินนี้ เฉพาะผู้ใช้ที่มีบทบาทผู้ดูแลระบบค่าตอบแทนระดับโลกเท่านั้นที่สามารถดำเนินการนี้ได้

source: This payout curve is in "Draft" status and is not used in any bonus plan. Deleting it will permanently remove it from the list. This action cannot be undone.
th_th: เส้นโค้งการจ่ายโบนัสนี้อยู่ในสถานะ "แบบร่าง" และไม่ได้ถูกใช้งานในแผนโบนัสใด ๆ การลบจะเป็นการลบออกจากรายการแบบถาวร และไม่สามารถยกเลิกการดำเนินการนี้ได้

source: Delete payout curve
th_th: ลบเส้นโค้งการจ่ายค่าตอบแทน

source: This payout curve is in "Ready" status and is not used in any bonus plan. Deleting it will permanently remove it from the list. This action cannot be undone.
th_th: เส้นโค้งการจ่ายโบนัสนี้อยู่ในสถานะ "พร้อมใช้งาน" และยังไม่ได้ถูกใช้ในแผนจ่ายโบนัสใด ๆ การลบจะเป็นการลบออกจากรายการอย่างถาวร ไม่สามารถย้อนกลับการทำรายการนี้ได้

source: Are you sure you want to delete the published and used payout curve?
th_th: คุณแน่ใจหรือไม่ว่าต้องการลบเส้นโค้งการจ่ายผลตอบแทนที่ถูกเผยแพร่และใช้งานอยู่

source: Cannot delete payout curve
th_th: ไม่สามารถลบเส้นโค้งการจ่ายผลตอบแทนได้

source: Used in the following places:
th_th: ใช้ในตำแหน่งต่อไปนี้:

source: The payout curve was successfully deleted.
th_th: ลบเส้นโค้งการจ่ายผลตอบแทนเรียบร้อยแล้ว

source: The payout curve was successfully duplicated.
th_th: ทำการคัดลอกเส้นโค้งการจ่ายเงินสำเร็จแล้ว

source: Open payout curve
th_th: เปิดเส้นโค้งการจ่ายเงิน

source: The end payout cannot be empty.
th_th: ผลจ่ายปลายทางต้องไม่เว้นว่าง

source: The end result cannot be empty.
th_th: ผลลัพธ์สุดท้ายต้องไม่เว้นว่าง

source: The payout cannot be empty.
th_th: ไม่สามารถเว้นว่างการจ่ายเงินได้

source: The result cannot be empty.
th_th: ผลลัพธ์ต้องไม่เว้นว่าง

source: The start payout cannot be empty.
th_th: ไม่สามารถปล่อยให้การจ่ายเงินเริ่มต้นว่างเปล่าได้

source: The start result cannot be empty.
th_th: ผลลัพธ์เริ่มต้นต้องไม่ว่างเปล่า

source: Locations
th_th: สถานที่ตั้ง

source: This payout curve ({{payoutCurveName}}) is currently used in the following bonus plans:
th_th: เส้นโค้งการจ่ายผลตอบแทนนี้ ({{payoutCurveName}}) กำลังถูกใช้ในแผนโบนัสต่อไปนี้:

source: Create skill & competency group
th_th: สร้างกลุ่มทักษะและความสามารถ
